app/controllers/customer_estimates_controller.rb

  def index
    @customer_estimates = CustomerEstimate.all
---
SELECT "customer_estimates".* FROM "customer_estimates"

  def create
    @customer_estimate = CustomerEstimate.new(customer_estimate_params)

    respond_to do |format|
      if @customer_estimate.save
---
INSERT INTO "customer_estimates" ("created_at", "email", "name", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 09 Dec 2014 04:36:27 UTC +00:00], ["email", "kenkauluwehi@gmail.com"], ["name", "Ken"], ["phone", "8086963911"], ["updated_at", Tue, 09 Dec 2014 04:36:27 UTC +00:00]]

  def destroy
    @customer_estimate.destroy
---
DELETE FROM "customer_estimates" WHERE "customer_estimates"."id" = $1  [["id", 1]]

    def set_customer_estimate
      @customer_estimate = CustomerEstimate.find(params[:id])
---
SELECT "customer_estimates".* FROM "customer_estimates" WHERE "customer_estimates"."id" = $1 LIMIT 1  [["id", "1"]]