app/controllers/testimonials_controller.rb

SELECT "testimonials".* FROM "testimonials"
---
  def index
    @testimonials = Testimonial.all

INSERT INTO "testimonials" ("comment", "company", "created_at", "date", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @testimonial = Testimonial.new(testimonial_params)

    respond_to do |format|
      if @testimonial.save

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_testimonial
      @testimonial = Testimonial.find(params[:id])